<a href="https://clarusway.com/contact-us/"><img align="center" src="https://i.ibb.co/B43qn24/officially-licensed-logo.png" alt="Open in Clarusway LMS" width="110" height="200" title="This notebook is licensed by Clarusway IT training school. Please contact the authorized persons about the conditions under which you can use or share."></a>

# Example -1 Inclass Data

In [1]:
import pandas as pd
import seaborn as sns
from scipy.stats import chi2_contingency

In [2]:
table = [[15, 21, 45, 13],[26, 31, 34, 5], [33, 17, 49, 20]]

In [3]:
# Ho: The two categorical variables are independent.
# H1: The two categorical variables are dependent.

In [4]:
stat, p, dof, expected = chi2_contingency(table)

In [5]:
print('stat=%.3f, p=%.4f' % (stat, p))
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. The two categorical variables are dependent')

stat=19.178, p=0.0039
We reject the null hypothesis. The two categorical variables are dependent

In [6]:
expected

array([[22.51132686, 20.99029126, 38.93851133, 11.55987055],
       [22.99029126, 21.4368932 , 39.76699029, 11.80582524],
       [28.49838188, 26.57281553, 49.29449838, 14.63430421]])

In [7]:
dof

6

In [8]:
# We can get the same result with manual method
from scipy import stats
1 - stats.chi2.cdf(19.17, 6)

0.0038859579107577424

# Example -2 Titanic Dataset

In [9]:
titanic = sns.load_dataset("titanic")
titanic.sample(7)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
171,0,3,male,4.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
582,0,2,male,54.0,0,0,26.0000,S,Second,man,True,NaN,Southampton,no,True
512,1,1,male,36.0,0,0,26.2875,S,First,man,True,E,Southampton,yes,True
663,0,3,male,36.0,0,0,7.4958,S,Third,man,True,NaN,Southampton,no,True
487,0,1,male,58.0,0,0,29.7000,C,First,man,True,B,Cherbourg,no,True
190,1,2,female,32.0,0,0,13.0000,S,Second,woman,False,NaN,Southampton,yes,True
83,0,1,male,28.0,0,0,47.1000,S,First,man,True,NaN,Southampton,no,True

How many rows and columns

In [10]:
titanic.shape

(891, 15)

How many null values are there in columns?

In [20]:
titanic.isnull().sum()

survived       0
pclass         0
sex            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [21]:
titanic=titanic.dropna()

In [22]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     889 non-null    int64
 1   pclass       889 non-null    int64
 2   sex          889 non-null    object
 3   sibsp        889 non-null    int64
 4   parch        889 non-null    int64
 5   fare         889 non-null    float64
 6   embarked     889 non-null    object
 7   class        889 non-null    category
 8   who          889 non-null    object
 9   adult_male   889 non-null    bool
 10  embark_town  889 non-null    object
 11  alive        889 non-null    object
 12  alone        889 non-null    bool
dtypes: bool(2), category(1), float64(1), int64(4), object(5)
memory usage: 79.1+ KB

In [23]:
titanic2=titanic.sample(200, random_state=42)

In [24]:
# Does gender affects survival ?

In [25]:
# We can see both male and female survivors using a crosstab
crosstab = pd.crosstab(titanic2.survived, titanic2.sex)
crosstab

sex       female  male
survived
0             24   101
1             56    19

In [16]:
# Ho: The two categorical variables (gender and survived) are independent.
# H1: The two categorical variables are dependent.

In [26]:
from scipy import stats
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=57.800, p=0.0000

In [27]:
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. Gender and survived variables are dependent')

We reject the null hypothesis. Gender and survived variables are dependent

# Example-3 Titanic Dataset

In [28]:
# Does class affect survival? In other words Class and survived variables are dependent or not?

In [29]:
crosstab = pd.crosstab(titanic2["survived"], titanic2["class"])
crosstab

class     First  Second  Third
survived
0            16      27     82
1            32      18     25

In [32]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=26.664, p=0.0000

In [33]:
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. Class and survived variables are dependent')

We reject the null hypothesis. Class and survived variables are dependent

In [35]:
crosstab = pd.crosstab(titanic2["embarked"], titanic2["class"])
crosstab

class     First  Second  Third
embarked
C            21       2     15
Q             1       2     12
S            26      41     80

In [36]:
#crosstab = pd.crosstab(titanic2["embarked"], titanic2["class"], normalize="columns")
#crosstab

In [37]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=30.661, p=0.0000

In [39]:
mpg = sns.load_dataset("mpg")
mpg.sample(7)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
205,28.0,4,97.0,75.0,2155,16.4,76,japan,toyota corolla
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
103,11.0,8,400.0,150.0,4997,14.0,73,usa,chevrolet impala
327,36.4,5,121.0,67.0,2950,19.9,80,europe,audi 5000s (diesel)
298,23.0,8,350.0,125.0,3900,17.4,79,usa,cadillac eldorado
181,33.0,4,91.0,53.0,1795,17.5,75,japan,honda civic cvcc
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [40]:
crosstab = pd.crosstab(mpg["origin"], mpg["cylinders"])
crosstab

cylinders  3   4  5   6    8
origin
europe     0  63  3   4    0
japan      4  69  0   6    0
usa        0  72  0  74  103

In [41]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=180.102, p=0.0000

In [42]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [54]:
diamonds = sns.load_dataset("diamonds")

In [55]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [67]:
crosstab = pd.crosstab(diamonds["clarity"], diamonds["color"])
crosstab

color       D     E     F     G     H     I    J
clarity
IF         73   158   385   681   299   143   51
VVS1      252   656   734   999   585   355   74
VVS2      553   991   975  1443   608   365  131
VS1       705  1281  1364  2148  1169   962  542
VS2      1697  2470  2201  2347  1643  1169  731
SI1      2083  2426  2131  1976  2275  1424  750
SI2      1370  1713  1609  1548  1563   912  479
I1         42   102   143   150   162    92   50

In [68]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=2047.079, p=0.0000